apojomovsky/pic8-hal/pic18fxx5x-hal/src/peripherals/pic18fxx5x_comp.c
/**
 * @file    pic18fxx5x_comp.c
 * @brief   Comparator driver, implementation (DS39632E §22.0).
 *
 *   Simpler than the PIC16 driver: CMCON is in the Access Bank (0xFB4), so
 *   there is no bank switching, and RMW uses split read+write
 *   (pic8_sfr_read8/write8) per the Phase 2 codegen lesson. The handle is
 *   copied into owned storage (the Phase 3 lesson). The sim backend sets
 *   C1OUT/C2OUT + CMIF from pic18_sim_drive_comp().
 */

#include "peripherals/pic18fxx5x_comp.h"
#include "core/pic18_irq.h"

/* ───────────────────────── handle storage ───────────────────────── */

static COMP_HandleTypeDef        g_comp_storage;
static const COMP_HandleTypeDef *g_comp = NULL;

/* ───────────────────────── public API ───────────────────────────── */

HAL_StatusTypeDef HAL_COMP_Init(const COMP_HandleTypeDef *h)
{
    if (!h) return HAL_INVALID;
    g_comp_storage = *h;
    g_comp = &g_comp_storage;

    /* Build CMCON (Register 22-1, Access Bank 0xFB4).
     *   bits 2:0 CM2:CM0 (mode)
     *   bit 3   CIS
     *   bit 4   C1INV
     *   bit 5   C2INV
     *   bits 7:6 C2OUT:C1OUT (read-only status, cleared on write). */
    uint8_t v = (uint8_t)(h->Mode & PIC_CMCON_CM_MASK);
    if (h->CIS)        v |= PIC_CMCON_CIS;
    if (h->C1Inverted) v |= PIC_CMCON_C1INV;
    if (h->C2Inverted) v |= PIC_CMCON_C2INV;
    pic8_sfr_write8(PIC_REG_CMCON, v);

    /* Interrupt enable. */
    HAL_IRQ_ClearFlag(PIC18_IRQ_CMP);
    if (h->ChangeCallback) HAL_IRQ_Enable(PIC18_IRQ_CMP);
    else                   HAL_IRQ_DisableSrc(PIC18_IRQ_CMP);

    return HAL_OK;
}

HAL_StatusTypeDef HAL_COMP_DeInit(void)
{
    HAL_IRQ_DisableSrc(PIC18_IRQ_CMP);
    HAL_IRQ_ClearFlag(PIC18_IRQ_CMP);
    pic8_sfr_write8(PIC_REG_CMCON, PIC_CMCON_POR_VALUE);   /* 0x07, off. */
    g_comp = NULL;
    return HAL_OK;
}

uint8_t HAL_COMP_C1Out(void)
{
    return (pic8_sfr_read8(PIC_REG_CMCON) & PIC_CMCON_C1OUT) ? 1U : 0U;
}

uint8_t HAL_COMP_C2Out(void)
{
    return (pic8_sfr_read8(PIC_REG_CMCON) & PIC_CMCON_C2OUT) ? 1U : 0U;
}

uint8_t HAL_COMP_IsChangeFlag(void)
{
    return (pic8_sfr_read8(PIC_REG_PIR2) & PIC_PIR2_CMIF) ? 1U : 0U;
}

void HAL_COMP_ClearChangeFlag(void)
{
    HAL_IRQ_ClearFlag(PIC18_IRQ_CMP);
}

/* ───────────────────────── ISR ───────────────────────────────────── */

void COMP_IRQHandler(void)
{
    if (!HAL_IRQ_GetFlag(PIC18_IRQ_CMP)) return;
    HAL_IRQ_ClearFlag(PIC18_IRQ_CMP);
    if (g_comp && g_comp->ChangeCallback) g_comp->ChangeCallback();
}